Revit 2024 API
ConnectorSet Class
A set that can contain any type of object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ConnectorSet : APIObject,
	IEnumerable
Visual Basic
Public Class ConnectorSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class ConnectorSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ConnectorSet
See Also
ConnectorSet Members
Autodesk.Revit.DB Namespace